src/InformationRegisters/ОчередьКассовогоСервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьКассовогоСервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПробития</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФискальногоЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаПробитияЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеансаИБ</Name>
					<Comment>Номер сеанса ИБ, в которой пробивался чек </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПробитияЧекаКассовымСервером</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПробитияЧекаКассовымСервером.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПробитияЧекаКассовымСервером</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробивается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ОчередьКассовогоСервера/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Добавить документ оплаты в очередь
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//
Процедура ДобавитьДокументОплатыВОчередь(ДокументОплаты, НеВыполнятьПроверки = Ложь) Экспорт
	
	Если Не НеВыполнятьПроверки Тогда
		
		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
			
			Если КассовыйСерверПовтИсп.КассаКассовогоСервера(ДокументОплаты.Организация) <> ДокументОплаты.Касса Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " касса документа отличается от кассы кассового сервера!";
			КонецЕсли;
			
			Если ДокументОплаты.ТипДенежныхСредств <> Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " обрабатываются только оплаты платежной картой или лицевым счетом!";
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда
			
			Если ДокументОплаты.УчтенныеАвансы.Количество() = 0 Тогда			
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " обрабатываются только оплаты платежной картой или лицевым счетом!";
			КонецЕсли;
			
			Если КассовыйСерверПовтИсп.КассаКассовогоСервера() <> ДокументОплаты.УчтенныеАвансы[0].КассаОплаты Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " касса документа отличается от кассы кассового сервера!";
			КонецЕсли;
			
		КонецЕсли;      		
		
		Если ДокументОплаты.Проведен = Ложь Тогда
			ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " документ не проведен";
		КонецЕсли;
		
		Если (ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.Реализация")
			И ЗначениеЗаполнено(ДокументОплаты.НомерЧекаККМ))
			ИЛИ (ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация")
			И ДокументОплаты.УчтенныеАвансы.НайтиСтроки(Новый Структура("НомерЧекаККМ, ТипАвансовыхСредств", 0, Перечисления.ТипыДенежныхСредств.ЛицевойСчет)).Количество() = 0) Тогда  	

			ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " документ пробит на ФР";
		КонецЕсли;
		
	КонецЕсли;
	
	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
			
			МенеджерЗаписи = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДатаПоступления  = ТекущаяДата();
			МенеджерЗаписи.ДокументОплаты   = ДокументОплаты;
			МенеджерЗаписи.СуммаОплаты      = ?(ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.Реализация"),
												ДокументОплаты.СуммаДокумента, 
												Документы.Реализация.ПолучитьСуммуНеФискализированныхУчтенныхАвансов(ДокументОплаты));
			МенеджерЗаписи.Статус           = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ожидание;
			
			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Добавить документ оплаты в очередь
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//
Процедура ДобавитьДокументОплатыВОчередь_v3(ДокументОплаты, Касса, НеВыполнятьПроверки = Ложь) Экспорт
	
	Если Не НеВыполнятьПроверки Тогда
		
		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") Тогда
			
			Если Касса <> ДокументОплаты.Касса Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " касса документа отличается от кассы кассового сервера!";
			КонецЕсли;
			
			Если ДокументОплаты.ТипДенежныхСредств <> Перечисления.ТипыДенежныхСредств.ПлатежнаяКарта Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " обрабатываются только оплаты платежной картой или лицевым счетом!";
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация") Тогда
			
			Если ДокументОплаты.УчтенныеАвансы.Количество() = 0 Тогда			
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " обрабатываются только оплаты платежной картой или лицевым счетом!";
			КонецЕсли;
			
			Если Касса <> ДокументОплаты.УчтенныеАвансы[0].КассаОплаты Тогда
				ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " касса документа отличается от кассы кассового сервера!";
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если ДокументОплаты.Проведен = Ложь Тогда
			ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " документ не проведен";
		КонецЕсли;
		
		Если (ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.Реализация")
			И ЗначениеЗаполнено(ДокументОплаты.НомерЧекаККМ))
			ИЛИ (ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Реализация")
			И ДокументОплаты.УчтенныеАвансы.НайтиСтроки(Новый Структура("НомерЧекаККМ, ТипАвансовыхСредств", 0, Перечисления.ТипыДенежныхСредств.ЛицевойСчет)).Количество() = 0) Тогда  	
			
			ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " документ пробит на ФР";
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ДокументОплаты.НомерЧекаККМ) Тогда
		//	ВызватьИсключение "Нельзя добавить в очередь фискализации " + ДокументОплаты + " документ пробит на ФР";
		//КонецЕсли;
		
	КонецЕсли;
	
	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
			
			МенеджерЗаписи = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДатаПоступления  = ТекущаяДатаСеанса();
			МенеджерЗаписи.ДокументОплаты   = ДокументОплаты;
			МенеджерЗаписи.СуммаОплаты      = ?(ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.Реализация"),
												ДокументОплаты.СуммаДокумента, 
												Документы.Реализация.ПолучитьСуммуНеФискализированныхУчтенныхАвансов(ДокументОплаты));
			МенеджерЗаписи.Статус           = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ожидание;
			
			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Добавить массив документов оплаты в очередь
//
// Параметры:
//  МассивДокументовОплаты	 - 	 - 
//
Процедура ДобавитьМассивДокументовОплатыВОчередь(МассивДокументовОплаты, НеВыполнятьПроверки = Ложь) Экспорт
	
	Для Каждого ДокументОплаты Из МассивДокументовОплаты Цикл
		
		Если НЕ ЗначениеЗаполнено(ДокументОплаты.НомерЧекаККМ)
			И ДокументОплаты.Проведен Тогда
			
			ДобавитьДокументОплатыВОчередь(ДокументОплаты, НеВыполнятьПроверки);
			
		КонецЕсли;
		
	КонецЦикла;
			
КонецПроцедуры

// Процедура - Записать признак начала пробития чека
//
// Параметры:
//  ДокументОплаты	 - 	 - 
//
Процедура ЗаписатьПризнакНачалаПробитияЧека(ДокументОплаты) Экспорт
	
	НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();
	
	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
			
			МенеджерЗаписи                    = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДокументОплаты     = ДокументОплаты;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.НомерСеансаИБ        = НомерТекущегоСеанса;
            МенеджерЗаписи.Статус               = Перечисления.СтатусыПробитияЧекаКассовымСервером.Пробивается;

			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;

	
КонецПроцедуры

// Процедура - Записать признак начала пробития чека для массива документов
//
// Параметры:
//  МассивДокументовОплаты	 - 	 - 
//
Процедура ЗаписатьПризнакНачалаПробитияЧекаДляМассиваДокументов(МассивДокументовОплаты) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ДокументОплаты Из МассивДокументовОплаты Цикл
		
		Если НЕ ЗначениеЗаполнено(ДокументОплаты.НомерЧекаККМ)
			И ДокументОплаты.Проведен Тогда
			
			ЗаписатьПризнакНачалаПробитияЧека(ДокументОплаты);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Записать признак успешного пробития чека
//
// Параметры:
//  ДокументОплаты		 - 	 - 
//  НомерФискальногоЧека - 	 - 
//
Процедура ЗаписатьПризнакУспешногоПробитияЧека(ДокументОплаты, НомерФискальногоЧека) Экспорт
	
	НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();

	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
			
			МенеджерЗаписи                    = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДокументОплаты     = ДокументОплаты;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.НомерФискальногоЧека = НомерФискальногоЧека;
			МенеджерЗаписи.ОшибкаПробитияЧека   = Неопределено;
			МенеджерЗаписи.ДатаПробития         = ТекущаяДата();
			МенеджерЗаписи.КоличествоПопыток    = МенеджерЗаписи.КоличествоПопыток + 1;
            МенеджерЗаписи.Статус               = Перечисления.СтатусыПробитияЧекаКассовымСервером.Пробит;
            МенеджерЗаписи.НомерСеансаИБ        = НомерТекущегоСеанса;

			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Записать признак успешного пробития чека
//
// Параметры:
//  ДокументОплаты		 - 	 - 
//  НомерФискальногоЧека - 	 - 
//
Процедура ЗаписатьОшибкуПробитияЧека(ДокументОплаты, ОписаниеОшибки) Экспорт
	
	НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();

	СчетчикПопыток = 0;
	
	Пока СчетчикПопыток < 5 Цикл
		
		НачатьТранзакцию();
		
		Попытка 
			
			МенеджерЗаписи = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДокументОплаты   = ДокументОплаты;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.ОшибкаПробитияЧека = СтрЗаменить(ОписаниеОшибки, Символы.ПС, "");
            МенеджерЗаписи.КоличествоПопыток    = МенеджерЗаписи.КоличествоПопыток + 1;
			МенеджерЗаписи.Статус               = Перечисления.СтатусыПробитияЧекаКассовымСервером.Ошибка;
			МенеджерЗаписи.НомерСеансаИБ        = НомерТекущегоСеанса;

			МенеджерЗаписи.Записать();
			
			ЗафиксироватьТранзакцию();
			
			Прервать;
			
		Исключение	
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			СчетчикПопыток = СчетчикПопыток + 1;
			
			Если СчетчикПопыток = 5 Тогда
				ВызватьИсключение ОписаниеОшибки;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить документ для оплаты из очереди
// Доработка Юля
// Возвращаемое значение:
//   - 
//
Функция ПолучитьВсеНеОплаченныеДокументИзОчередиДляТекущегоСеанса(ДатаНачалаОтбора = Неопределено, Организация = Неопределено, Касса = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсеСеансы           = ПолучитьСеансыИнформационнойБазы();
	НомераВсехСеансовИБ = Новый Массив;
	
	Для Каждого Сеанс ИЗ ВсеСеансы Цикл
		НомераВсехСеансовИБ.Добавить(Сеанс.НомерСеанса);
	КонецЦикла;
	
	НомерТекущегоСеансаИБ = НомерСеансаИнформационнойБазы();	

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОчередьКассовогоСервера.ДокументОплаты КАК ДокументОплаты
	|ИЗ
	|	РегистрСведений.ОчередьКассовогоСервера КАК ОчередьКассовогоСервера
	|ГДЕ
	|	ОчередьКассовогоСервера.НомерФискальногоЧека = 0
	|	И ВЫБОР
	|			КОГДА &ДатаНачалаОтбора <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ОчередьКассовогоСервера.ДатаПоступления >= &ДатаНачалаОтбора
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ОчередьКассовогоСервера.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПробитияЧекаКассовымСервером.Ожидание)
	|	И ВЫБОР
	|			КОГДА &ОрганизацияОтбор = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОчередьКассовогоСервера.ДокументОплаты.Организация = &ОрганизацияОтбор
	|		КОНЕЦ
	|	И &УсловиеКасса
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОчередьКассовогоСервера.ДокументОплаты
	|ИЗ
	|	РегистрСведений.ОчередьКассовогоСервера КАК ОчередьКассовогоСервера
	|ГДЕ
	|	ОчередьКассовогоСервера.НомерФискальногоЧека = 0
	|	И ВЫБОР
	|			КОГДА &ДатаНачалаОтбора <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ОчередьКассовогоСервера.ДатаПоступления >= &ДатаНачалаОтбора
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (ОчередьКассовогоСервера.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПробитияЧекаКассовымСервером.Пробивается)
	|			ИЛИ ОчередьКассовогоСервера.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПробитияЧекаКассовымСервером.Ошибка))
	|	И ОчередьКассовогоСервера.НомерСеансаИБ = &НомерТекущегоСеансаИБ
	|	И ВЫБОР
	|			КОГДА &ОрганизацияОтбор = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОчередьКассовогоСервера.ДокументОплаты.Организация = &ОрганизацияОтбор
	|		КОНЕЦ
	|	И &УсловиеКасса
	|	И ОчередьКассовогоСервера.КоличествоПопыток < 4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОчередьКассовогоСервера.ДокументОплаты
	|ИЗ
	|	РегистрСведений.ОчередьКассовогоСервера КАК ОчередьКассовогоСервера
	|ГДЕ
	|	ОчередьКассовогоСервера.НомерФискальногоЧека = 0
	|	И ВЫБОР
	|			КОГДА &ДатаНачалаОтбора <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ОчередьКассовогоСервера.ДатаПоступления >= &ДатаНачалаОтбора
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (ОчередьКассовогоСервера.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПробитияЧекаКассовымСервером.Пробивается)
	|			ИЛИ ОчередьКассовогоСервера.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПробитияЧекаКассовымСервером.Ошибка))
	|	И НЕ ОчередьКассовогоСервера.НомерСеансаИБ = &НомерТекущегоСеансаИБ
	|	И НЕ ОчередьКассовогоСервера.НомерСеансаИБ В (&НомераВсехСеансовИБ)
	|	И ВЫБОР
	|			КОГДА &ОрганизацияОтбор = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОчередьКассовогоСервера.ДокументОплаты.Организация = &ОрганизацияОтбор
	|		КОНЕЦ
	|	И &УсловиеКасса
	|	И ОчередьКассовогоСервера.КоличествоПопыток < 4
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОплаты");
	
	УсловиеКасса = 
	"И ОчередьКассовогоСервера.ДокументОплаты.Касса = &КассаОтбор";	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеКасса", ?(ЗначениеЗаполнено(Касса), УсловиеКасса, ""));	
	
	Запрос.УстановитьПараметр("ДатаНачалаОтбора"     , ?(ЗначениеЗаполнено(ДатаНачалаОтбора), ДатаНачалаОтбора, Неопределено));
	Запрос.УстановитьПараметр("НомерТекущегоСеансаИБ", НомерТекущегоСеансаИБ); 
	Запрос.УстановитьПараметр("НомераВсехСеансовИБ"  , НомераВсехСеансовИБ); 
	Запрос.УстановитьПараметр("ОрганизацияОтбор"     , Организация);
	Запрос.УстановитьПараметр("КассаОтбор"           , Касса);
	                                               
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОплаты");
	
КонецФункции

// Функция - Количество документов в очереди
// Доработка Юля, параметр Организация
// Параметры:
//  ДатаНачалаОтбора - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция КоличествоДокументовВОчередиДляТекущегоСеанса(ДатаНачалаОтбора = Неопределено, Организация = Неопределено, Касса = Неопределено) Экспорт
	
	Возврат ПолучитьВсеНеОплаченныеДокументИзОчередиДляТекущегоСеанса(ДатаНачалаОтбора, Организация, Касса).Количество()
	
КонецФункции

// Функция - Обновление записи в случае успешного пробития вручную.
//
Процедура ЗаписатьПризнакПробитияЧекаВручную(ДокументОплаты, НомерФискальногоЧека) Экспорт    	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОчередьКассовогоСервера.НомерФискальногоЧека, 0) КАК НомерФискальногоЧека
	|ИЗ
	|	РегистрСведений.ОчередьКассовогоСервера КАК ОчередьКассовогоСервера
	|ГДЕ
	|	ОчередьКассовогоСервера.ДокументОплаты = &ДокументОплаты";
	
	Запрос.УстановитьПараметр("ДокументОплаты", ДокументОплаты);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда   	
		Выборка = Результат.Выбрать();
		
		Если Выборка.НомерФискальногоЧека = Неопределено Тогда
			
			НомерТекущегоСеанса = НомерСеансаИнформационнойБазы();
			
			Попытка   
				МенеджерЗаписи = РегистрыСведений.ОчередьКассовогоСервера.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ДокументОплаты = ДокументОплаты;
				МенеджерЗаписи.Прочитать();   
				
				МенеджерЗаписи.НомерФискальногоЧека = НомерФискальногоЧека;
				МенеджерЗаписи.ОшибкаПробитияЧека   = "Пробит вручную";
				МенеджерЗаписи.ДатаПробития         = ТекущаяДата();
				МенеджерЗаписи.Статус               = Перечисления.СтатусыПробитияЧекаКассовымСервером.Пробит;
				МенеджерЗаписи.НомерСеансаИБ        = НомерТекущегоСеанса;
				
				МенеджерЗаписи.Записать();				
				
			Исключение  
				
				ОписаниеОшибки = ОписаниеОшибки();
				ВызватьИсключение ОписаниеОшибки;
				
			КонецПопытки;   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти
